public class Main {
    public static void main(String[] args) {
        SSSR sssr = new SSSR();

        // Добавляем несколько изменений
        sssr.addChange("1922-12-30", "Создание СССР", "Все республики");
        sssr.addChange("1936-12-05", "Создание Казахской и Киргизской ССР", "Казахская ССР, Киргизская ССР");
        sssr.addChange("1940-08-03", "Вхождение Литовской ССР", "Литовская ССР");
        sssr.addChange("1991-12-26", "Распад СССР", "Все республики");

        // Выводим всю историю изменений
        sssr.showHistory();
    }
}